# WorksetTable Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetTable Class
Members See Also
---
A table containing references to all the worksets contained in a document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class WorksetTable : IDisposable
```

Visual Basic
---
```text
Public Class WorksetTable _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WorksetTable : IDisposable
```

# Remarks
There is one WorksetTable for each document. There will be at least one default workset in the table, even if worksharing has not been enabled in the document.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksetTable
# See Also
WorksetTable Members
Autodesk.Revit.DB Namespace